# ===================== מינים נתמכים =====================
species_order = [
    "Cordyceps",
    "Hericium",
    "Reishi",
    "Shiitake",
    "Maitake",
    "Turkey Tail",
]

species_labels_he = {
    "Cordyceps": "קורדיספס",
    "Hericium": "רעמת אריה",
    "Reishi": "ריישי",
    "Shiitake": "שיטאקה",
    "Maitake": "מייטאקה",
    "Turkey Tail": "טרקי טייל",
}
# ========= WORKFLOW: שלבי עבודה לכל מין (בעברית כמו בשיטס) =========
WORKFLOW = {
    "קורדיספס": [
        "צלחות פטרי", "תרבית נוזלית", "אינקובציה",
        "אנדרלייט", "מיון", "קטיף ראשוני", "קטיף אחרון", "ייבוש","מלאי"
    ],
    "ריישי": [
        "צלחות פטרי", "P2G", "G2G", "אינקולציה בלוקים",
        "מיון", "קטיף", "ייבוש","מלאי"
    ],
    "שיטאקה": [
        "צלחות פטרי", "P2G", "G2G", "אינקולציה בלוקים",
        "מיון", "קטיף", "ייבוש","מלאי"
    ],
    "רעמת אריה": [
        "צלחות פטרי", "P2G", "G2G", "אינקולציה בלוקים",
        "מיון", "קטיף", "ייבוש","מלאי"
    ],
    "מייטאקה": [
        "צלחות פטרי", "P2G", "G2G", "אינקולציה בלוקים",
        "מיון", "קטיף", "ייבוש","מלאי"
    ],
    "טרקי טייל": [
        "צלחות פטרי", "P2G", "G2G", "אינקולציה בלוקים",
        "מיון", "קטיף", "ייבוש","מלאי"
    ],
}
# ===================== שמות שלבים =====================
STAGES = [
    "צלחות פטרי",
    "תרבית נוזלית",
    "P2G",              # מצלחת לגרעינים
    "G2G",              # גרעין לגרעין
    "אינקולציה בלוקים",
    "אינקובציה",
    "אנדרלייט",
    "מיון",
    "קטיף ראשוני",
    "קטיף אחרון",
    "קטיף",             # פלאש יחיד
    "ייבוש"
    "מלאי"
]
